tap 'homebrew/bundle'

# xz is a dependency of the_silver_searcher and unless it is installed
# as `universal`, it can mess up Ruby stuff.
# http://www.nokogiri.org/tutorials/installing_nokogiri.html#mac_os_x
brew 'xz', args: ['universal']

brew 'awscli'
brew 'coreutils'
brew 'bash-completion'
brew 'git'
brew 'hub'
brew 'jq'
brew 'macvim'
brew 'mitmproxy'
brew 'shellcheck'
brew 'the_silver_searcher'
brew 'tmux'

# gpg setup
brew 'gnupg'
brew 'gpg-agent'
brew 'pinentry'
brew 'pinentry-mac'

# Completion scripts...
brew 'bash-completion'
brew 'tmuxinator-completion'
brew 'vagrant-completion'

# Casks...
tap 'caskroom/cask'
cask '1password'
cask 'alfred'
cask 'caffeine'
cask 'google-chrome'
cask 'iterm2'
cask 'vagrant'
cask 'virtualbox'
cask 'vmware-fusion'

tap 'caskroom/fonts'
cask 'font-sourcecodepro-nerd-font'
