# dotfile management
tap 'thoughtbot/formulae'
brew 'thoughtbot/formulae/rcm'

brew 'awscli'
brew 'coreutils'
brew 'bash-completion'
brew 'git'
brew 'hub'
brew 'jq'
brew 'pandoc'
brew 'reattach-to-user-namespace'
brew 'shellcheck'
brew 'the_silver_searcher'
brew 'tmux'
brew 'vim'

# gpg setup
brew 'gnupg'
brew 'hopenpgp-tools'
brew 'pinentry-mac'

# Completion scripts...
brew 'bash-completion'

# Casks...
cask 'alfred'
cask 'caffeine'
cask 'docker'
cask '1password'
cask 'iterm2'

# App store...
brew 'mas'

tap 'homebrew/cask-fonts'
cask 'font-sourcecodepro-nerd-font'
